# Brew Casks:
cask "ghostty"
cask "hiddenbar"
cask "rectangle"
cask "stats"
cask "visual-studio-code"

# VS Code Extensions: 
vscode "aaron-bond.better-comments"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "igorsbitnev.error-gutters"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "manishsencha.readme-preview"
vscode "mechatroner.rainbow-csv"
vscode "morningfrog.urdf-visualizer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "prisma.prisma"
vscode "ranch-hand-robotics.rde-pack"
vscode "ranch-hand-robotics.rde-ros-2"
vscode "ranch-hand-robotics.urdf-editor"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "smilerobotics.urdf"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-arduino.vscode-arduino-community"
vscode "vsls-contrib.codetour"
vscode "whizkydee.material-palenight-theme"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
